public class MergeSortedArray88 {
    public static int[] merge(int[] nums1, int m, int[] nums2, int n) {
        int i = m - 1; //ชี้ไปยังตำแหน่งสุดท้ายของส่วนที่มีค่าใน nums1 (ตำแหน่งของสมาชิกที่มีค่าใน nums1 ซึ่งคือ m - 1)
        int j = n - 1; //ชี้ไปยังตำแหน่งสุดท้ายใน nums2
        int k = m + n - 1; //ชี้ไปยังตำแหน่งสุดท้ายของอาเรย์ nums1 ทั้งหมด ซึ่งเป็นที่ที่เราจะเริ่มเพิ่มสมาชิก
        
        while (j >= 0) { //วนลูปจนกว่าตัวชี้ j (ซึ่งใช้ในการเข้าถึงสมาชิกใน nums2) จะมีค่า 0 หรือน้อยกว่า (เมื่อไม่มีสมาชิกใน nums2 ที่เหลืออยู่ให้รวม)
            if (i >= 0 && nums1[i] > nums2[j]) { //ตรวจสอบว่าค่าที่ nums1[i] มีค่ามากกว่า nums2[j] หรือไม่
                nums1[k--] = nums1[i--]; //ถ้าใช่ ให้นำค่า nums1[i] ไปวางที่ nums1[k] และลดค่าตัวชี้ i และ k ลง
            } else { //ถ้า nums2[j] มีค่ามากกว่า (หรือเท่ากับ)
                nums1[k--] = nums2[j--]; //ให้นำค่า nums2[j] ไปวางที่ nums1[k] และลดค่าตัวชี้ j และ k ลง
            }
        }
        return nums1;
    }
}
